import { images } from "./images";

export const hero = [
  {
    h1: "اكتشف أحدث العروض على السيارات!",
    p: "استفد من أفضل الصفقات عند شراء أو بيع سيارتك المستعملة.",
    img: images.HERO_1,
  },
  {
    h1: "ابتاع سيارتك المستعملة بأمان وثقة!",
    p: "تسوق بين أفضل العروض والخيارات لشراء أو بيع سيارتك المستعملة.",
    img: images.HERO_2,
  },
  {
    h1: "تصفح أسطولنا المميز من السيارات المستعملة!",
    p: "اختر سيارتك المثالية وقم بعملية الشراء أو البيع بكل يسر وسهولة.",
    img: images.HERO_3,
  },
];
